Autodesk.Revit.DB.Face.Project(Autodesk.Revit.DB.XYZ)
Projects the specified point on the face.
point: The point to be projected.
Returns: Geometric information if projection is successful;
if projection fails or the nearest point is outside of this face, returns null.
Remarks:
The following is the meaning of IntersectionResult's members:
XYZPoint is the nearest point to the projected point on the face.UVPoint is the UV coordinates of the nearest point on the face.Distance is the distance from the point to the face.EdgeObject is the edge if projected point is near an edge.EdgeParameter is the parameter of the nearest point on the edge.

Autodesk.Revit.DB.Face.Intersect(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Curve@)
Calculates the intersection of the specified face with this face and returns the intersection results.
face: The specified face to intersect with this face.
result: A single Curve representing the intersection.
Returns:
FaceIntersectionFaceResult.Intersecting - One or more intersections were encountered.
SetComparisonResult.NonIntersecting - There is no intersection found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The face is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The intersection calculation fails.

Autodesk.Revit.DB.Face.Intersect(Autodesk.Revit.DB.Face)
Calculates the intersection of the specified face with this face and returns the intersection results.
face: The specified face to intersect with this face.
Returns:
FaceIntersectionFaceResult.Intersecting - One or more intersections were encountered.
SetComparisonResult.NonIntersecting - There is no intersection found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The face is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The intersection calculation fails.

Autodesk.Revit.DB.Face.Intersect(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.IntersectionResultArray@)
Calculates the intersection of the specified curve with this face and returns the intersection results.
curve: The specified curve to intersect with this face.
results: Provides more information about the intersection.
Returns:
SetComparisonResult.Overlap - One or more intersections were encountered.  The output argument has the results.
SetComparisonResult.Subset - The curve is coincident with the surface.
SetComparisonResult.Disjoint - There is no intersection found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The curve is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The intersection calculation fails.
Remarks:
The array of the intersection results contains one entry for each point where this face and the curve intersect.
The following is the meaning of IntersectionResult's members:
XYZPoint is the evaluated intersection point.UVPoint is the intersection parameters on the face.Parameter is the raw intersection parameter on the curve.EdgeObject is the edge if the intersection happens to be near an edge of the face.EdgeParameter is the parameter of the nearest point on the edge.

Autodesk.Revit.DB.Face.Intersect(Autodesk.Revit.DB.Curve)
Calculates the intersection of the specified curve with this face.
Calculates the intersection of the specified curve with this face.
curve: The specified curve to intersect with this face.
Returns:
SetComparisonResult.Overlap - One or more intersections were encountered.
SetComparisonResult.Subset - The curve is coincident with the surface.
SetComparisonResult.Disjoint - There is no intersection found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The curve is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The intersection calculation fails.

Autodesk.Revit.DB.Face.IsInside(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.IntersectionResult@)
Indicates whether the specified point is within this face and outputs additional information about the point location.
point: The parameters to be evaluated, in natural parameterization of the face.
result: Provides more information only when the point is on the edge; otherwise, null.
Returns: True if within this face or on its boundary, otherwise False.
Remarks:
The following is the meaning of the IntersectionResult members when the point is on the edge:
EdgeObject is the edge that the point lies on EdgeParameter is the parameter of the point on the edge nearest to the UV point UV is the specified point

Autodesk.Revit.DB.Face.IsInside(Autodesk.Revit.DB.UV)
Indicates whether the specified point is within this face.
Indicates whether the specified point is within this face.
point: The parameters to be evaluated, in natural parameterization of the face.
Returns: True if point is within this face or on its boundary, otherwise false.

Autodesk.Revit.DB.Face.ComputeNormal(Autodesk.Revit.DB.UV)
Returns the normal vector for the face at the given point.
point: The parameters to be evaluated, in natural parameterization of the face.
Returns: The normal vector. This vector will be normalized.
Remarks:
Differs from the normal returned from Autodesk.Revit.DB.Face.ComputeDerivatives(Autodesk.Revit.DB.UV) in that this vector is the "face normal" vector.
It will always be oriented to point out of a solid that contains the face.

Autodesk.Revit.DB.Face.ComputeSecondDerivatives(Autodesk.Revit.DB.UV)
Returns the second partial derivatives of the face at the specified point.
point: The parameters to be evaluated, in natural parameterization of the face.
Returns: The second partial derivatives of the face at the specified point.
Remarks:
It does not take the bounding edge loops into account.
Since: 2016

Autodesk.Revit.DB.Face.ComputeDerivatives(Autodesk.Revit.DB.UV)
Returns the first partial derivatives of the underlying surface at the specified point.
point: The parameters to be evaluated, in natural parameterization of the face.
Returns: A transformation containing tangent vectors and a normal vector.
Remarks:
The following is the meaning of the transformation members:
Origin is the point on the face (equivalent to Autodesk.Revit.DB.Face.Evaluate(Autodesk.Revit.DB.UV));BasisX is the tangent vector along the U coordinate (partial derivative with respect to U).BasisY is the tangent vector along the V coordinate (partial derivative with respect to V).BasisZ is the underlying surface's normal vector.  This is not necessarily aligned with the normal vector pointing out of a
solid that contains the face, to get that value use Autodesk.Revit.DB.Face.ComputeNormal(Autodesk.Revit.DB.UV).
None of the vectors are normalized.

Autodesk.Revit.DB.Face.Period(System.Int32)
The period of the underlying surface in the specified parametric direction.
paramIdx: Use 0 for U coordinates and 1 for V coordinates.
Returns: The real number equal to the period of the underlying surface.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when an incorrect coordinate dimension is supplied.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this face is not cyclic in the specified direction.

Autodesk.Revit.DB.Face.IsCyclic(System.Int32)
Indicates whether the underlying surface is periodic in the specified parametric direction.
paramIdx: Use 0 for U coordinates and 1 for V coordinates.
Returns: True if the underlying surface is cyclic in the specified coordinate space; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when an incorrect coordinate dimension is supplied.

Autodesk.Revit.DB.Face.Area
The area of this face.
Remarks:
Returns zero if fails to compute the area. In some cases, this area may be estimated.

Autodesk.Revit.DB.Face.Reference
Returns a stable reference to the face.
This value may be  if the object does not store a corresponding reference.
This might be due to any of the following reasons:
The face was obtained from an API member which does not permit options to generate corresponding References (most
API members, besides Element.Geometry, do not have an option to generate a Reference). The corresponding geometry object does not permit referencing.

Autodesk.Revit.DB.Face.GetBoundingBox
Returns the UV bounding box of the face.
Returns: A BoundingBoxUV with the extents of the parameterization of the face.
Since: 2011

Autodesk.Revit.DB.Face.Evaluate(Autodesk.Revit.DB.UV)
Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.
Remarks: The evaluation is performed on the underlying Surface, and can return results outside of the boundaries of the face.
params: The parameters to be evaluated, in natural parameterization of the face.
Returns: The XYZ coordinates.

Autodesk.Revit.DB.Face.Triangulate(System.Double)
Returns a triangular mesh approximation to the face.
Since: 2013
levelOfDetail: The level of detail. Its range is from 0 to 1. 0 is the lowest level of detail and 1 is the highest.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when level of detail is less than 0 or greater than 1.

Autodesk.Revit.DB.Face.Triangulate
Returns a triangular mesh approximation to the face.
Remarks: Tolerance of approximation is defined internally by Revit to be adequate for
display purposes.

Autodesk.Revit.DB.Face.IsTwoSided
Determines if a face is two-sided (degenerate).

Autodesk.Revit.DB.Face.MaterialElementId
The element ID of the material from which this face is composed.

Autodesk.Revit.DB.Face.GetEdgesAsCurveLoops
Returns a list of closed curve loops that correspond to the edge loops of the face.
Curves in each curve loop correspond to individual edges.
Remarks:
Orientations of the curves and curve loops match the orientations of the face's edges and edge loops.
The order of the CurveLoops should be considered as arbitrary.
Returns: A list of closed curve loops, that correspond edges of face.
Since: 2015

Autodesk.Revit.DB.Face.EdgeLoops
A collection of edge loops.  Each edge loop represents one of the closed boundaries of the face.

Autodesk.Revit.DB.Face.GetRegions
Gets the face regions (created, for example, by the Split Face command) of the face.
Remarks: Use the FaceSplitter class to filter and find elements which may generate face regions.
Returns: A list of faces, one for the main face of the object hosting the Split Face (such as wall or floor)
and one face for each Split Face regions.

Autodesk.Revit.DB.Face.HasRegions
Identifies if the face contains regions (which can be created, for example, by the Split Face command).
Remarks: If this is true, use Autodesk.Revit.DB.Face.GetRegions to get access to the specific Faces which make up the regions.

Autodesk.Revit.DB.Face.OrientationMatchesSurfaceOrientation
Returns true if this face's orientation matches the orientation of the face's surface,
false if they have opposite orientations.
Remarks:
(Revit uses only orientable faces and surfaces).
At any point on a face or surface, the face's or surface's orientation is specified by
the normal vector at that point.
The face's normal vector can be the same or opposite to that of its surface.
If OrientationMatchesSurfaceOrientation() is true, then the face’s normal vector is the same as
that of its surface at each point on the face, otherwise the normal vectors are opposite.
See also Surface::OrientationMatchesParametricOrientation.

Autodesk.Revit.DB.Face.GetSurface
Returns a copy of this face's surface.
Returns:  A copy of this face's surface.
Since: 2018

Autodesk.Revit.DB.Face
A bounded face of a 3d solid or open shell.
Remarks: Faces are defined by surfaces (Autodesk.Revit.DB.Surface) bounded by edge loops. The surfaces provide
natural UV parameterization to the faces.